##### 6.11  Write a predicate valid-date? that takes three numbers as arguments, representing a month, a day of the month, and a year. Your procedure should return #t if the numbers represent a valid date (e.g., it isn't the 31st of September). February has 29 days if the year is divisible by 4, except that if the year is divisible by 100 it must also be divisible by 400.
```Scheme
> (valid-date? 10 4 1949)
#T

> (valid-date? 20 4 1776)
#F

> (valid-date? 5 0 1992)
#F

> (valid-date? 2 29 1900)
#F

> (valid-date? 2 29 2000)
#T
```

```Scheme
(define (leap-year? year)
  (cond ((and (not (= (remainder year 400) 0)) (= (remainder year 100) 0)) #f)
        ((= (remainder year 4) 0) #t)
        (else #f)))
(define (valid-date? month day year)
  (cond ((or (> 1 day) (< 31 day)) #f)
        ((or (> 0 month) (< 12 month)) #f)
        ((and (member? month '(4 6 9 11)) (< day 31)) #t)
        ((and (member? month '(1 3 5 7 8 10 12)) (< day 32)) #t)
        ((and (= month 2) (or (and (leap-year? year) (< day 30)) (and (not (leap-year? year)) (< day 29)))) #t)
        (else #f)
        ))
```
